import img_0 from "./images/asus_rog.jpg"
import img_1 from "./images/laptops/Apple_MacBook_Pro_16_Space_Gray_2019.jpg"
import img_2 from "./images/laptops/Apple_MacBook_Air_13_Silver_2019__MVFK2__2340980_6369696.jpg"
import img_3 from "./images/laptops/Apple_MacBook_12_Space_2017_Grey__MNYF2__1494855_2742672.jpg"
import img_4 from "./images/laptops/Apple_MacBook_12_Gold_2017__MNYK2__garantiy_magazina_1494856_2742662.jpg"
import img_5 from "./images/laptops/asus_predator.jpg"
import img_6 from "./images/laptops/Asus_G731GU__G731GU-EV214__2296087_6287636.jpg"
import img_7 from "./images/laptops/Asus_FX505DU__FX505DU-AL079__2286278_4402953.jpg"
import img_8 from "./images/laptops/Asus_X712FA__X712FA-BX320__2206271_4301030.jpg"
export default [
    //Apple
    {
        id: 0,
        img: img_1,
        brand: "Apple",
        model: "MacBook Pro 16 Space Gray 2019 (MVVJ2)",
        processor: "Intel",
        RAM: "8gb",
        graphic: "AMD Radeon Pro 5300M, 4 ГБ GDDR6",
        graphicType: "discrete",
        credit: false,
        discount: false,
        inStock: true,
        price: 51750,
        screen: 16,
        parameters: "\tТип: ноутбук\n" +
            "Диагональ экрана: 15.6 \"\n" +
            "Разрешение экрана: 1366x768\n" +
            "Покрытие экрана: матовое\n" +
            "Набор микросхем: Integrated Intel CPU\n" +
            "Производитель процессора: Intel\n" +
            "Серия процессора: Pentium\n" +
            "Модель процессора: N5000\n" +
            "Кол-во ядер процессора: 4\n" +
            "Объем оперативной памяти: 4 ГБ\n" +
            "Тип видеокарты: интегрированная\n" +
            "Серия видеокарты: Intel HD Graphics\n" +
            "Тип накопителя: HDD\n" +
            "Емкость жесткого диска: 500 ГБ\n" +
            "Обороты шпинделя: 5400 об/мин\n" +
            "Wi-Fi: 802.11 a/b/g/n/ac\n" +
            "Bluetooth: да\n" +
            "Разъемы и порты ввода-вывода: HDMI, Комбинированный аудиопорт"
    },
    {
        id: 1,
        img: img_0,
        brand: "Asus",
        model: "ROG Strix G531GT",
        processor: "Intel Core i5",
        RAM: "8gb",
        graphic: "GeForce GTX1650",
        graphicType: "discrete",
        price: 63149,
        credit: false,
        discount: false,
        inStock: true,
        delivery: true,
        screen: 15.6,
        parameters: "Производитель: Apple\n" +
            "Линейка: MacBook Pro 16\" 2019\n" +
            "Тип: Ноутбук\n" +
            "Конструкция: Классический\n" +
            "Операционная система: macOS Catalina\n" +
            "Диагональ, дюймов: 16\n" +
            "Тип матрицы: IPS\n" +
            "Тип покрытия: глянцевое\n" +
            "Разрешение: 3072x1920\n" +
            "Сенсорный: нет\n" +
            "HDR: нет\n" +
            "Другое: Retina Display, 226 PPI\n" +
            "Процессор: Intel Core i7-9750H\n" +
            "Базовая тактовая частота, ГГц: 2,6\n" +
            "Максимальная тактовая частота, ГГц: 4,5\n" +
            "Количество ядер процессора: 6\n" +
            "Чипсет: нет данных\n" +
            "Оперативная память, ГБ: 16\n" +
            "Максимальный объем оперативной памяти, ГБ: 16\n" +
            "Тип памяти: DDR4-2666 МГц\n" +
            "Жесткий диск, ГБ: нет\n" +
            "SSD, ГБ: 512\n" +
            "Оптический привод: нет\n" +
            "Графический адаптер, объем памяти: AMD Radeon Pro 5300M, 4 ГБ GDDR6\n" +
            "Внешние порты: 4xThunderbolt 3 (PD, Display Port), 1x3,5 mm Audio (Combo)\n" +
            "Картридер: нет\n" +
            "WEB-камера: есть\n" +
            "Подсветка клавиатуры:\n" +
            "Пассивная система охлаждения: нет\n" +
            "Сканер отпечатка пальцев:\n" +
            "Клавиатура с цифровым блоком: нет\n" +
            "Сетевой адаптер: нет\n" +
            "Wi-Fi: 802.11 ac\n" +
            "Bluetooth: 5,0\n" +
            "3G/LTE: нет\n" +
            "Вес, кг: 2,0\n" +
            "Размер, мм: 357,9x245,9x16,2\n" +
            "Материал корпуса: алюминий\n" +
            "Цвет крышки: серый космос\n" +
            "Цвет корпуса: серый космос\n" +
            "Защищенный ноутбук: нет\n" +
            "Емкость, мАч: нет данных\n" +
            "Количество ячеек: нет данных\n" +
            "Мощность, Вт*ч: 100\n" +
            "Напряжение батареи, В: нет данных\n" +
            "Тип аккумулятора: Li-Pol"
    },
    {
        id: 2,
        img: img_2,
        brand: "Apple",
        model: "MacBook Air 13 Silver 2019 (MVFK2) *EU",
        processor: "Intel",
        RAM: "8gb",
        graphic: " Intel UHD Graphics 617",
        graphicType: "integrated",
        price: 28205,
        credit: true,
        discount: false,
        inStock: false,
        delivery: false,
        screen: 13.3,
        parameters: "Код производителя: MVFL2\n" +
            "Диагональ дисплея: 13.3\"\n" +
            "Разрешение дисплея: 2560x1600\n" +
            "Тип матрицы: IPS\n" +
            "Дисплей: Глянцевый экран\n" +
            "Процессор: Intel Core i5 (1.6 - 3.6 ГГц)\n" +
            "Количество ядер: 2 ядра\n" +
            "Оперативная память: 8 ГБ\n" +
            "Тип оперативной памяти: LPDDR3 - 2133 МГц\n" +
            "Тип видеокарты: Интегрированная\n" +
            "Видеокарта: Intel UHD Graphics 617\n" +
            "Объем видеопамяти: Использует оперативную память\n" +
            "Накопитель SSD: 128 ГБ\n" +
            "Оптический привод: Без дисковода\n" +
            "Операционная система: Mac OS Mojave\n" +
            "Беспроводные технологии: Wi?Fi: подключение к сетям Wi?Fi стандарта 802.11ac; совместимость со стандартом IEEE 802.11a/b/g/n, Bluetooth 4.2\n" +
            "Порты и разъемы: 2 x Type-C (Thunderbolt 3), 1 x Выход 3,5 мм для наушников\n" +
            "Аудиосистема и мультимедиа возможности: Стерео­динамики с широким динамическим диапазоном, Три микрофона\n" +
            "Разрешение веб-камеры: HD WebCam\n" +
            "Аккумуляторная батарея: Встроенный литий-полимерный аккумулятор ёмкостью 49,9 Вт ч, Встроенный литий-полимерный аккумулятор ёмкостью 49,9 Вт ч, До 12 часов работы в интернете по беспроводной связи, До 13 часов при просмотре фильмов из iTunes\n" +
            "Сканер отпечатка пальцев: Есть\n" +
            "Материал корпуса: Алюминий\n" +
            "Язык клавиатуры: Английский, Русский\n" +
            "Подсветка клавиатуры: Есть\n" +
            "Цвет: Серебристый\n" +
            "Размеры: 304.1 x 212.4 x 15.6 мм\n" +
            "Вес: 1.25 кг\n" +
            "Комплектация: MacBook Air, Адаптер питания USB?C мощностью 30 Вт, Кабель USB?C для зарядки (2 м)"
    },
    {
        id: 3,
        img: img_3,
        brand: "Apple",
        model: "MacBook 12 Space 2017 Grey (MNYF2) *EU",
        processor: "Intel",
        RAM: "8gb",
        graphic: " ",
        graphicType: "integrated",
        price: 24905,
        credit: true,
        discount: true,
        inStock: true,
        delivery: true,
        screen: 12,
        parameters: `Линейка: MacBook 12" 2017
Тип: Ноутбук
Конструкция: Классический
Операционная система: macOS Sierra
Диагональ, дюймов: 12
Тип матрицы: IPS
Тип покрытия: глянцевое
Разрешение: 2304x1440
Сенсорный: нет
Процессор: Intel Core M3-7Y32
Частота, ГГц: 1,2-3
Количество ядер процессора: 2
Оперативная память, ГБ: 8
Максимальный объем оперативной памяти, ГБ: 16
Тип памяти: LPDDR3
Жесткий диск, ГБ: нет
SSD, ГБ: 256
Оптический привод: нет
Графический адаптер, объем памяти: Intel HD Graphics 615
Внешние порты: 1xUSB 3.1 (Type-C), headphone out
Картридер: нет
WEB-камера: есть
Подсветка клавиатуры: есть
Wi-Fi: 802.11 a/b/g/n/ac
Bluetooth: 4.0
3G/LTE: нет
Вес, кг: 0,92
Размер, мм: 280,5x196,5x3,5-13,1
Материал корпуса: алюминий
Цвет корпуса: серый космос
Емкость, мАч: 5477
Количество ячеек: 4
Мощность, Вт*ч: 41,4
Тип аккумулятора: Li-Pol`
    },
    {
        id: 4,
        img: img_4,
        brand: "Apple",
        model: "MacBook 12 Gold 2017 (MNYK2) *EU",
        processor: "Intel",
        RAM: "8gb",
        graphic: " Intel UHD Graphics 617",
        graphicType: "integrated",
        price: 24905,
        credit: false,
        discount: false,
        inStock: false,
        delivery: false,
        screen: 12,
        parameters: `Линейка: MacBook 12" 2017
Тип: Ноутбук
Конструкция: Классический
Операционная система: macOS Sierra
Диагональ, дюймов: 12
Тип матрицы: IPS
Тип покрытия: глянцевое
Разрешение: 2304x1440
Сенсорный: нет
Процессор: Intel Core M3-7Y32
Частота, ГГц: 1,2-3
Количество ядер процессора: 2
Оперативная память, ГБ: 8
Максимальный объем оперативной памяти, ГБ: 16
Тип памяти: LPDDR3
Жесткий диск, ГБ: нет
SSD, ГБ: 256
Оптический привод: нет
Графический адаптер, объем памяти: Intel HD Graphics 615
Внешние порты: 1xUSB 3.1 (Type-C), headphone out
Картридер: нет
WEB-камера: есть
Подсветка клавиатуры: есть
Wi-Fi: 802.11 a/b/g/n/ac
Bluetooth: 4.0
3G/LTE: нет
Вес, кг: 0,92
Размер, мм: 280,5x196,5x3,5-13,1
Материал корпуса: алюминий
Цвет корпуса: серый космос
Емкость, мАч: 5477
Количество ячеек: 4
Мощность, Вт*ч: 41,4
Тип аккумулятора: Li-Pol`
    },
    //Asus
    {
        id: 5,
        img: img_5,
        brand: "Asus",
        model: "Predator Helios 300 PH317-51-5577",
        gaming: true,
        processor: "Intel",
        RAM: "16gb",
        graphic: "NVIDIA GeForce GTX 1050 Ti, 4 ГБ",
        graphicType: "discrete",
        price: 40559,
        credit: true,
        discount: false,
        inStock: true,
        delivery: false,
        screen: 17.3,
        parameters: `Линейка: MacBook 12" 2017
Тип: Ноутбук
Конструкция: Классический
Операционная система: macOS Sierra
Диагональ, дюймов: 12
Тип матрицы: IPS
Тип покрытия: глянцевое
Разрешение: 2304x1440
Сенсорный: нет
Процессор: Intel Core M3-7Y32
Частота, ГГц: 1,2-3
Количество ядер процессора: 2
Оперативная память, ГБ: 8
Максимальный объем оперативной памяти, ГБ: 16
Тип памяти: LPDDR3
Жесткий диск, ГБ: нет
SSD, ГБ: 256
Оптический привод: нет
Графический адаптер, объем памяти: Intel HD Graphics 615
Внешние порты: 1xUSB 3.1 (Type-C), headphone out
Картридер: нет
WEB-камера: есть
Подсветка клавиатуры: есть
Wi-Fi: 802.11 a/b/g/n/ac
Bluetooth: 4.0
3G/LTE: нет
Вес, кг: 0,92
Размер, мм: 280,5x196,5x3,5-13,1
Материал корпуса: алюминий
Цвет корпуса: серый космос
Емкость, мАч: 5477
Количество ячеек: 4
Мощность, Вт*ч: 41,4
Тип аккумулятора: Li-Pol`
    },
    {
        id: 6,
        img: img_6,
        brand: "Asus",
        model: "G731GU (G731GU-EV214)",
        processor: "Intel",
        RAM: "16gb",
        graphic: "G731GU (G731GU-EV214)",
        graphicType: "discrete",
        price: 38559,
        credit: false,
        discount: false,
        inStock: true,
        delivery: true,
        screen: 17.3,
        parameters: `Производитель: ASUS
Модель: G731GU
Артикул: G731GU-EV214
Серия (модельный ряд): ASUS G
Тип ноутбука: Игровой
Диагональ дисплея: 17.3"
Разрешение: FullHD (1920 х 1080)
Поверхность экрана: Anti-Glare
Тип матрицы: IPS
Частота обновления экрана: 144Hz
Поколение процессора Intel: 9-th generation
Процессор: Intel Core i7 9750H (2.6-4.5 ГГц)
Тип оперативной памяти: DDR4
Объем оперативной памяти: 16 ГБ
Количество слотов для оперативной памяти: 2
Типы внутренних накопителей: SSD
Объем SSD: 512 ГБ
Оптический привод: No ODD
Видеокарта: NVIDIA GeForce GTX 1660 Ti
Объем встроенной видеопамяти: 6 ГБ
Дополнительные возможности: встроенный микрофон
Дополнительные возможности: стереодинамики
Беспроводные технологии: Bluetooth
Беспроводные технологии: Wi-Fi
Сетевой адаптер: Gigabit Ethernet
Интерфейсы и подключения: USB 3.2 Type-C
Интерфейсы и подключения: 3 х USB 3.2
Интерфейсы и подключения: HDMI
Интерфейсы и подключения: Комбинированный аудиоразъем
Операционная система: без операционной системы
Емкость батареи: 4 cell
Особенности: подсветка клавиатуры
Ширина: 399 мм
Высота: 26.5 мм
Глубина: 293 мм
Вес: 2.85 кг
Цвет корпуса: Silver Blue
Страна производства: Китай`
    },
    {
        id: 7,
        img: img_7,
        brand: "Asus",
        model: "FX505DU (FX505DU-AL079)",
        gaming: true,
        processor: "Intel",
        RAM: "16gb",
        graphic: "NVIDIA GeForce GTX 1660 Ti",
        graphicType: "discrete",
        price: 38559,
        credit: true,
        discount: false,
        inStock: true,
        delivery: true,
        screen: 15.6,
        parameters: `Производитель: ASUS
Модель: FX505DU
Артикул: FX505DU-AL079
Серия (модельный ряд): ASUS FX
Тип ноутбука: Игровой
Диагональ дисплея: 15.6"
Разрешение: FullHD (1920 х 1080)
Поверхность экрана: Anti-Glare
Тип матрицы: IPS
Частота обновления экрана: 120Hz
Процессор: AMD Ryzen 7 3750H (2.3 - 4.0 GHz)
Тип оперативной памяти: DDR4
Объем оперативной памяти: 16 ГБ
Количество слотов для оперативной памяти: 2
Типы внутренних накопителей: SSD
Объем SSD: 512 ГБ
Оптический привод: No ODD
Видеокарта: NVIDIA GeForce GTX 1660 Ti
Объем встроенной видеопамяти: 6 ГБ
Веб-камера: WEB-Camera
Дополнительные возможности: встроенный микрофон
Дополнительные возможности: стереодинамики
Беспроводные технологии: Bluetooth
Беспроводные технологии: Wi-Fi
Сетевой адаптер: Gigabit Ethernet
Интерфейсы и подключения: 1 х USB 2.0
Интерфейсы и подключения: 2 х USB 3.2
Интерфейсы и подключения: HDMI
Интерфейсы и подключения: Комбинированный аудиоразъем
Операционная система: без операционной системы
Емкость батареи: 3 cell
Безопасность: гнездо для замка Kensington
Особенности: подсветка клавиатуры
Ширина: 360 мм
Высота: 25 мм
Глубина: 262 мм
Вес: 2.2 кг
Цвет корпуса: Black
Страна производства: Китай`
    },
    {
        id: 8,
        img: img_8,
        brand: "Asus",
        model: "FX505DU (FX505DU-AL079)",
        gaming: false,
        processor: "Intel",
        RAM: "8gb",
        graphic: "Intel UHD Graphics 620",
        graphicType: "integrated",
        price: 11856,
        credit: true,
        discount: true,
        inStock: true,
        delivery: true,
        screen: 17.3,
        parameters: `Производитель: ASUS
Модель: X712FA
Артикул: X712FA-BX320
Серия (модельный ряд): ASUS X
Тип ноутбука: Для работы и учебы
Диагональ дисплея: 17.3"
Разрешение: HD+ (1600 x 900)
Поверхность экрана: Anti-Glare
Поколение процессора Intel: 8-th generation
Процессор: Intel Core i3 8145U
Тип оперативной памяти: DDR4
Объем оперативной памяти: 8 ГБ
Типы внутренних накопителей: HDD
Объем HDD: 1 ТБ
Оптический привод: No ODD
Кардридер: Card-reader
Видеокарта: Intel UHD Graphics 620
Веб-камера: WEB-Camera
Дополнительные возможности: встроенный микрофон
Дополнительные возможности: стереодинамики
Беспроводные технологии: Bluetooth
Беспроводные технологии: Wi-Fi
Интерфейсы и подключения: 2 x USB 2.0
Интерфейсы и подключения: USB 3.1 Type-C
Интерфейсы и подключения: 1 х USB 3.1
Интерфейсы и подключения: HDMI
Интерфейсы и подключения: Комбинированный аудиоразъем
Операционная система: Endless OS
Емкость батареи: 2 cell
Вес: 2.3 кг
Цвет корпуса: Silver
Страна производства: Китай`
    },
]